knowledge_base = [
    {
        "question": "Что такое ИИ?",
        "answer": "Искусственный интеллект — это имитация человеческого интеллекта машинами."
    },
    {
        "question": "Как работает Google Custom Search?",
        "answer": "Google CSE использует API Google для поиска по определённым сайтам, указанным в настройках поисковой системы."
    },
    {
        "question": "Что такое Gemini?",
        "answer": "Gemini — это модель искусственного интеллекта от Google, которая может отвечать на вопросы и выполнять различные задачи, используя продвинутую обработку языка."
    }
]