knowledge_base = [
    {
        "question": "Що таке ШІ?",
        "answer": "Штучний інтелект — це імітація людського інтелекту машинами."
    },
    {
        "question": "Як працює Google Custom Search?",
        "answer": "Google CSE використовує API Google для пошуку на визначених вебсайтах, які задані в налаштуваннях пошукової системи."
    },
    {
        "question": "Що таке Gemini?",
        "answer": "Gemini — це модель штучного інтелекту від Google, яка може відповідати на запитання та виконувати різні завдання, використовуючи передові технології обробки мови."
    }
]